***
# SQL Homework - Employee Database: A Myster in Two Parts
***

# Bonus
* ## Import SQL database into Pandas

In [2]:
# Importing neccessary Dependency's:
import pandas as pd
import matplotlib.pyplot as plt
import sqlalchemy 
import psycopg2
from sqlalchemy import create_engine
from config import password
from config import username

In [3]:
# Connecting to localhost database:
engine = create_engine(f'postgresql://{username}:{password}@localhost:5432/employee_db')
connection = engine.connect()

In [4]:
# Review the tables from SQL Database
engine.table_names()

['departments', 'titles', 'employees', 'dept_emp', 'dept_manager', 'salaries']

* ## Create a histogram to visualize the most common salary ranges for employees.
***
> 1. #### Importing tables from SQL for analysis:

In [5]:
# Query all records in the database from SQL:
# Table 1:
# Reading in from SQL the employees database:
employees_df = pd.read_sql("SELECT * FROM employees", connection, parse_dates=['birth_date', 'hire_date'])
employees_df.head()

   emp_no emp_title_id birth_date  first_name  last_name sex  hire_date
0  473302        s0001 1953-07-25    Hideyuki   Zallocco   M 1990-04-28
1  475053        e0002 1954-11-18       Byong  Delgrande   F 1991-09-07
2   57444        e0002 1958-01-30       Berry       Babb   F 1992-03-21
3  421786        s0001 1957-09-28       Xiong   Verhoeff   M 1987-11-26
4  282238        e0003 1952-10-28  Abdelkader    Baumann   F 1991-01-18

In [6]:
# Table 2:
# Reading in from SQL the Departments database:
departments_df = pd.read_sql("SELECT * FROM departments", connection)
departments_df

  dept_no           dept_name
0    d001           Marketing
1    d002             Finance
2    d003     Human Resources
3    d004          Production
4    d005         Development
5    d006  Quality Management
6    d007               Sales
7    d008            Research
8    d009    Customer Service